FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/pdma_reg.h
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[6:0]   |REQSRC4   |Channel 4 Request Source Selection
     * |        |          |This filed defines which peripheral is connected to PDMA channel 4
     * |        |          |User can configure the peripheral setting by REQSRC4.
     * |        |          |Note: The channel configuration is the same as REQSRC0 field
     * |        |          |Please refer to the explanation of REQSRC0.
     * |[14:8]  |REQSRC5   |Channel 5 Request Source Selection
     * |        |          |This filed defines which peripheral is connected to PDMA channel 5
     * |        |          |User can configure the peripheral setting by REQSRC5.
     * |        |          |Note: The channel configuration is the same as REQSRC0 field
     * |        |          |Please refer to the explanation of REQSRC0.
     * |[22:16] |REQSRC6   |Channel 6 Request Source Selection
     * |        |          |This filed defines which peripheral is connected to PDMA channel 6
     * |        |          |User can configure the peripheral setting by REQSRC6.
     * |        |          |Note: The channel configuration is the same as REQSRC0 field
     * |        |          |Please refer to the explanation of REQSRC0.
     * |[30:24] |REQSRC7   |Channel 7 Request Source Selection
     * |        |          |This filed defines which peripheral is connected to PDMA channel 7
     * |        |          |User can configure the peripheral setting by REQSRC7.
     * |        |          |Note: The channel configuration is the same as REQSRC0 field
     * |        |          |Please refer to the explanation of REQSRC0.
     */

    DSCT_T DSCT[ 8 ];          /*!< [0x0000 ~ 0x007C] DMA Embedded Description Table 0~7                      */
    __I uint32_t CURSCAT[ 8 ]; /*!< [0x0080~0x009C] Current Scatter-Gather Descriptor Table Address of PDMA Channel 0~7 */
    __I uint32_t RESERVE0[ 216 ];
    __IO uint32_t CHCTL;       /*!< [0x0400] PDMA Channel Control Register                                    */
    __O uint32_t PAUSE;        /*!< [0x0404] PDMA Transfer Pause Control Register                             */
    __O uint32_t SWREQ;        /*!< [0x0408] PDMA Software Request Register                                   */
    __I uint32_t TRGSTS;       /*!< [0x040c] PDMA Channel Request Status Register                             */
    __IO uint32_t PRISET;      /*!< [0x0410] PDMA Fixed Priority Setting Register                             */
    __O uint32_t PRICLR;       /*!< [0x0414] PDMA Fixed Priority Clear Register                               */
    __IO uint32_t INTEN;       /*!< [0x0418] PDMA Interrupt Enable Register                                   */
    __IO uint32_t INTSTS;      /*!< [0x041c] PDMA Interrupt Status Register                                   */
    __IO uint32_t ABTSTS;      /*!< [0x0420] PDMA Channel Read/Write Target Abort Flag Register               */
    __IO uint32_t TDSTS;       /*!< [0x0424] PDMA Channel Transfer Done Flag Register                         */
    __IO uint32_t ALIGN;       /*!< [0x0428] PDMA Transfer Alignment Status Register                          */
    __I uint32_t TACTSTS;      /*!< [0x042c] PDMA Transfer Active Flag Register                               */
    __IO uint32_t TOUTPSC;     /*!< [0x0430] PDMA Time-out Prescaler Register                                 */
    __IO uint32_t TOUTEN;      /*!< [0x0434] PDMA Time-out Enable Register                                    */
    __IO uint32_t TOUTIEN;     /*!< [0x0438] PDMA Time-out Interrupt Enable Register                          */
    __IO uint32_t SCATBA;      /*!< [0x043c] PDMA Scatter-Gather Descriptor Table Base Address Register       */
    __IO uint32_t TOC0_1;      /*!< [0x0440] PDMA Channel 0 and Channel 1 Time-out Counter Register           */
    __I uint32_t RESERVE1[ 7 ];
    __IO uint32_t CHRST;       /*!< [0x0460] PDMA Channel Reset Register                                      */
    __I uint32_t RESERVE2[ 7 ];
    __IO uint32_t REQSEL0_3;   /*!< [0x0480] PDMA Channel 0 to Channel 3 Request Source Select Register       */
    __IO uint32_t REQSEL4_7;   /*!< [0x0484] PDMA Channel 4 to Channel 7 Request Source Select Register       */
    __I uint32_t RESERVE4[ 30 ];
    STRIDE_T STRIDE[ 6 ];      /*!< [0x0500 ~ 0x052C] Stride function control register of PDMA Channel 0 ~ 5  */
} PDMA_T;



/**
 *  @addtogroup PDMA_CONST PDMA Bit Field Definition
 *  Constant Definitions for PDMA Controller
 * @{ */

#define PDMA_DSCT_CTL_OPMODE_Pos      ( 0 )                                              /*!< PDMA_T::DSCT_CTL: OPMODE Position     */
#define PDMA_DSCT_CTL_OPMODE_Msk      ( 0x3ul << PDMA_DSCT_CTL_OPMODE_Pos )              /*!< PDMA_T::DSCT_CTL: OPMODE Mask         */

#define PDMA_DSCT_CTL_TXTYPE_Pos      ( 2 )                                              /*!< PDMA_T::DSCT_CTL: TXTYPE Position     */
#define PDMA_DSCT_CTL_TXTYPE_Msk      ( 0x1ul << PDMA_DSCT_CTL_TXTYPE_Pos )              /*!< PDMA_T::DSCT_CTL: TXTYPE Mask         */

#define PDMA_DSCT_CTL_BURSIZE_Pos     ( 4 )                                              /*!< PDMA_T::DSCT_CTL: BURSIZE Position    */
#define PDMA_DSCT_CTL_BURSIZE_Msk     ( 0x7ul << PDMA_DSCT_CTL_BURSIZE_Pos )             /*!< PDMA_T::DSCT_CTL: BURSIZE Mask        */

#define PDMA_DSCT_CTL_TBINTDIS_Pos    ( 7 )                                              /*!< PDMA_T::DSCT_CTL: TBINTDIS Position      */
#define PDMA_DSCT_CTL_TBINTDIS_Msk    ( 0x1ul << PDMA_DSCT_CTL_TBINTDIS_Pos )            /*!< PDMA_T::DSCT_CTL: TBINTDIS Mask          */

#define PDMA_DSCT_CTL_SAINC_Pos       ( 8 )                                              /*!< PDMA_T::DSCT_CTL: SAINC Position      */
#define PDMA_DSCT_CTL_SAINC_Msk       ( 0x3ul << PDMA_DSCT_CTL_SAINC_Pos )               /*!< PDMA_T::DSCT_CTL: SAINC Mask          */

