FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/pdma_reg.h
#define PDMA_DSCT_CTL_DAINC_Pos       ( 10 )                                             /*!< PDMA_T::DSCT_CTL: DAINC Position      */
#define PDMA_DSCT_CTL_DAINC_Msk       ( 0x3ul << PDMA_DSCT_CTL_DAINC_Pos )               /*!< PDMA_T::DSCT_CTL: DAINC Mask          */

#define PDMA_DSCT_CTL_TXWIDTH_Pos     ( 12 )                                             /*!< PDMA_T::DSCT_CTL: TXWIDTH Position    */
#define PDMA_DSCT_CTL_TXWIDTH_Msk     ( 0x3ul << PDMA_DSCT_CTL_TXWIDTH_Pos )             /*!< PDMA_T::DSCT_CTL: TXWIDTH Mask        */

#define PDMA_DSCT_CTL_TXACK_Pos       ( 14 )                                             /*!< PDMA_T::DSCT_CTL: TXACK Position      */
#define PDMA_DSCT_CTL_TXACK_Msk       ( 0x1ul << PDMA_DSCT_CTL_TXACK_Pos )               /*!< PDMA_T::DSCT_CTL: TXACK Mask          */

#define PDMA_DSCT_CTL_STRIDEEN_Pos    ( 15 )                                             /*!< PDMA_T::DSCT_CTL: STRIDEEN Position  */
#define PDMA_DSCT_CTL_STRIDEEN_Msk    ( 0x1ul << PDMA_DSCT_CTL_STRIDEEN_Pos )            /*!< PDMA_T::DSCT_CTL: STRIDEEN Mask      */

#define PDMA_DSCT_CTL_TXCNT_Pos       ( 16 )                                             /*!< PDMA_T::DSCT_CTL: TXCNT Position      */
#define PDMA_DSCT_CTL_TXCNT_Msk       ( 0xfffful << PDMA_DSCT_CTL_TXCNT_Pos )            /*!< PDMA_T::DSCT_CTL: TXCNT Mask          */

#define PDMA_DSCT_SA_SA_Pos           ( 0 )                                              /*!< PDMA_T::DSCT_SA: SA Position          */
#define PDMA_DSCT_SA_SA_Msk           ( 0xfffffffful << PDMA_DSCT_SA_SA_Pos )            /*!< PDMA_T::DSCT_SA: SA Mask              */

#define PDMA_DSCT_DA_DA_Pos           ( 0 )                                              /*!< PDMA_T::DSCT_DA: DA Position          */
#define PDMA_DSCT_DA_DA_Msk           ( 0xfffffffful << PDMA_DSCT_DA_DA_Pos )            /*!< PDMA_T::DSCT_DA: DA Mask              */

#define PDMA_DSCT_NEXT_NEXT_Pos       ( 0 )                                              /*!< PDMA_T::DSCT_NEXT: NEXT Position      */
#define PDMA_DSCT_NEXT_NEXT_Msk       ( 0xfffful << PDMA_DSCT_NEXT_NEXT_Pos )            /*!< PDMA_T::DSCT_NEXT: NEXT Mask          */

#define PDMA_DSCT_NEXT_EXENEXT_Pos    ( 16 )                                             /*!< PDMA_T::DSCT_FIRST: NEXT Position     */
#define PDMA_DSCT_NEXT_EXENEXT_Msk    ( 0xfffful << PDMA_DSCT_NEXT_EXENEXT_Pos )         /*!< PDMA_T::DSCT_FIRST: NEXT Mask         */

#define PDMA_CURSCAT_CURADDR_Pos      ( 0 )                                              /*!< PDMA_T::CURSCAT: CURADDR Position     */
#define PDMA_CURSCAT_CURADDR_Msk      ( 0xfffffffful << PDMA_CURSCAT_CURADDR_Pos )       /*!< PDMA_T::CURSCAT: CURADDR Mask         */

#define PDMA_CHCTL_CHENn_Pos          ( 0 )                                              /*!< PDMA_T::CHCTL: CHENn Position          */
#define PDMA_CHCTL_CHENn_Msk          ( 0xfffful << PDMA_CHCTL_CHENn_Pos )               /*!< PDMA_T::CHCTL: CHENn Mask              */

#define PDMA_PAUSE_PAUSEn_Pos         ( 0 )                                              /*!< PDMA_T::PAUSE: PAUSEn Position           */
#define PDMA_PAUSE_PAUSEn_Msk         ( 0xfffful << PDMA_PAUSE_PAUSEn_Pos )              /*!< PDMA_T::PAUSE: PAUSEn Mask               */

#define PDMA_SWREQ_SWREQn_Pos         ( 0 )                                              /*!< PDMA_T::SWREQ: SWREQn Position         */
#define PDMA_SWREQ_SWREQn_Msk         ( 0xfffful << PDMA_SWREQ_SWREQn_Pos )              /*!< PDMA_T::SWREQ: SWREQn Mask             */

#define PDMA_TRGSTS_REQSTSn_Pos       ( 0 )                                              /*!< PDMA_T::TRGSTS: REQSTSn Position       */
#define PDMA_TRGSTS_REQSTSn_Msk       ( 0xfffful << PDMA_TRGSTS_REQSTSn_Pos )            /*!< PDMA_T::TRGSTS: REQSTSn Mask           */

#define PDMA_PRISET_FPRISETn_Pos      ( 0 )                                              /*!< PDMA_T::PRISET: FPRISETn Position      */
#define PDMA_PRISET_FPRISETn_Msk      ( 0xfffful << PDMA_PRISET_FPRISETn_Pos )           /*!< PDMA_T::PRISET: FPRISETn Mask          */

#define PDMA_PRICLR_FPRICLRn_Pos      ( 0 )                                              /*!< PDMA_T::PRICLR: FPRICLRn Position      */
#define PDMA_PRICLR_FPRICLRn_Msk      ( 0xfffful << PDMA_PRICLR_FPRICLRn_Pos )           /*!< PDMA_T::PRICLR: FPRICLRn Mask          */

#define PDMA_INTEN_INTENn_Pos         ( 0 )                                              /*!< PDMA_T::INTEN: INTENn Position         */
#define PDMA_INTEN_INTENn_Msk         ( 0xfffful << PDMA_INTEN_INTENn_Pos )              /*!< PDMA_T::INTEN: INTENn Mask             */

#define PDMA_INTSTS_ABTIF_Pos         ( 0 )                                              /*!< PDMA_T::INTSTS: ABTIF Position         */
#define PDMA_INTSTS_ABTIF_Msk         ( 0x1ul << PDMA_INTSTS_ABTIF_Pos )                 /*!< PDMA_T::INTSTS: ABTIF Mask             */

#define PDMA_INTSTS_TDIF_Pos          ( 1 )                                              /*!< PDMA_T::INTSTS: TDIF Position          */
#define PDMA_INTSTS_TDIF_Msk          ( 0x1ul << PDMA_INTSTS_TDIF_Pos )                  /*!< PDMA_T::INTSTS: TDIF Mask              */

#define PDMA_INTSTS_ALIGNF_Pos        ( 2 )                                              /*!< PDMA_T::INTSTS: ALIGNF Position        */
#define PDMA_INTSTS_ALIGNF_Msk        ( 0x1ul << PDMA_INTSTS_ALIGNF_Pos )                /*!< PDMA_T::INTSTS: ALIGNF Mask            */

#define PDMA_INTSTS_REQTOF0_Pos       ( 8 )                                              /*!< PDMA_T::INTSTS: REQTOF0 Position       */
#define PDMA_INTSTS_REQTOF0_Msk       ( 0x1ul << PDMA_INTSTS_REQTOF0_Pos )               /*!< PDMA_T::INTSTS: REQTOF0 Mask           */

#define PDMA_INTSTS_REQTOF1_Pos       ( 9 )                                              /*!< PDMA_T::INTSTS: REQTOF1 Position       */
#define PDMA_INTSTS_REQTOF1_Msk       ( 0x1ul << PDMA_INTSTS_REQTOF1_Pos )               /*!< PDMA_T::INTSTS: REQTOF1 Mask           */

#define PDMA_ABTSTS_ABTIF0_Pos        ( 0 )                                              /*!< PDMA_T::ABTSTS: ABTIF0 Position        */
#define PDMA_ABTSTS_ABTIF0_Msk        ( 0x1ul << PDMA_ABTSTS_ABTIF0_Pos )                /*!< PDMA_T::ABTSTS: ABTIF0 Mask            */

#define PDMA_ABTSTS_ABTIF1_Pos        ( 1 )                                              /*!< PDMA_T::ABTSTS: ABTIF1 Position        */
#define PDMA_ABTSTS_ABTIF1_Msk        ( 0x1ul << PDMA_ABTSTS_ABTIF1_Pos )                /*!< PDMA_T::ABTSTS: ABTIF1 Mask            */

