FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/pdma_reg.h
#define PDMA_ABTSTS_ABTIF2_Pos        ( 2 )                                              /*!< PDMA_T::ABTSTS: ABTIF2 Position        */
#define PDMA_ABTSTS_ABTIF2_Msk        ( 0x1ul << PDMA_ABTSTS_ABTIF2_Pos )                /*!< PDMA_T::ABTSTS: ABTIF2 Mask            */

#define PDMA_ABTSTS_ABTIF3_Pos        ( 3 )                                              /*!< PDMA_T::ABTSTS: ABTIF3 Position        */
#define PDMA_ABTSTS_ABTIF3_Msk        ( 0x1ul << PDMA_ABTSTS_ABTIF3_Pos )                /*!< PDMA_T::ABTSTS: ABTIF3 Mask            */

#define PDMA_ABTSTS_ABTIF4_Pos        ( 4 )                                              /*!< PDMA_T::ABTSTS: ABTIF4 Position        */
#define PDMA_ABTSTS_ABTIF4_Msk        ( 0x1ul << PDMA_ABTSTS_ABTIF4_Pos )                /*!< PDMA_T::ABTSTS: ABTIF4 Mask            */

#define PDMA_ABTSTS_ABTIF5_Pos        ( 5 )                                              /*!< PDMA_T::ABTSTS: ABTIF5 Position        */
#define PDMA_ABTSTS_ABTIF5_Msk        ( 0x1ul << PDMA_ABTSTS_ABTIF5_Pos )                /*!< PDMA_T::ABTSTS: ABTIF5 Mask            */

#define PDMA_ABTSTS_ABTIF6_Pos        ( 6 )                                              /*!< PDMA_T::ABTSTS: ABTIF6 Position        */
#define PDMA_ABTSTS_ABTIF6_Msk        ( 0x1ul << PDMA_ABTSTS_ABTIF6_Pos )                /*!< PDMA_T::ABTSTS: ABTIF6 Mask            */

#define PDMA_ABTSTS_ABTIF7_Pos        ( 7 )                                              /*!< PDMA_T::ABTSTS: ABTIF7 Position        */
#define PDMA_ABTSTS_ABTIF7_Msk        ( 0x1ul << PDMA_ABTSTS_ABTIF7_Pos )                /*!< PDMA_T::ABTSTS: ABTIF7 Mask            */

#define PDMA_ABTSTS_ABTIF8_Pos        ( 8 )                                              /*!< PDMA_T::ABTSTS: ABTIF8 Position        */
#define PDMA_ABTSTS_ABTIF8_Msk        ( 0x1ul << PDMA_ABTSTS_ABTIF8_Pos )                /*!< PDMA_T::ABTSTS: ABTIF8 Mask            */

#define PDMA_ABTSTS_ABTIF9_Pos        ( 9 )                                              /*!< PDMA_T::ABTSTS: ABTIF9 Position        */
#define PDMA_ABTSTS_ABTIF9_Msk        ( 0x1ul << PDMA_ABTSTS_ABTIF9_Pos )                /*!< PDMA_T::ABTSTS: ABTIF9 Mask            */

#define PDMA_ABTSTS_ABTIF10_Pos       ( 10 )                                             /*!< PDMA_T::ABTSTS: ABTIF10 Position        */
#define PDMA_ABTSTS_ABTIF10_Msk       ( 0x1ul << PDMA_ABTSTS_ABTIF10_Pos )               /*!< PDMA_T::ABTSTS: ABTIF10 Mask            */

#define PDMA_ABTSTS_ABTIF11_Pos       ( 11 )                                             /*!< PDMA_T::ABTSTS: ABTIF11 Position        */
#define PDMA_ABTSTS_ABTIF11_Msk       ( 0x1ul << PDMA_ABTSTS_ABTIF11_Pos )               /*!< PDMA_T::ABTSTS: ABTIF11 Mask            */

#define PDMA_ABTSTS_ABTIF12_Pos       ( 12 )                                             /*!< PDMA_T::ABTSTS: ABTIF12 Position        */
#define PDMA_ABTSTS_ABTIF12_Msk       ( 0x1ul << PDMA_ABTSTS_ABTIF12_Pos )               /*!< PDMA_T::ABTSTS: ABTIF12 Mask            */

#define PDMA_ABTSTS_ABTIF13_Pos       ( 13 )                                             /*!< PDMA_T::ABTSTS: ABTIF13 Position        */
#define PDMA_ABTSTS_ABTIF13_Msk       ( 0x1ul << PDMA_ABTSTS_ABTIF13_Pos )               /*!< PDMA_T::ABTSTS: ABTIF13 Mask            */

#define PDMA_ABTSTS_ABTIF14_Pos       ( 14 )                                             /*!< PDMA_T::ABTSTS: ABTIF14 Position        */
#define PDMA_ABTSTS_ABTIF14_Msk       ( 0x1ul << PDMA_ABTSTS_ABTIF14_Pos )               /*!< PDMA_T::ABTSTS: ABTIF14 Mask            */

#define PDMA_ABTSTS_ABTIF15_Pos       ( 15 )                                             /*!< PDMA_T::ABTSTS: ABTIF15 Position        */
#define PDMA_ABTSTS_ABTIF15_Msk       ( 0x1ul << PDMA_ABTSTS_ABTIF15_Pos )               /*!< PDMA_T::ABTSTS: ABTIF15 Mask            */

#define PDMA_TDSTS_TDIF0_Pos          ( 0 )                                              /*!< PDMA_T::TDSTS: TDIF0 Position        */
#define PDMA_TDSTS_TDIF0_Msk          ( 0x1ul << PDMA_TDSTS_TDIF0_Pos )                  /*!< PDMA_T::TDSTS: TDIF0 Mask            */

#define PDMA_TDSTS_TDIF1_Pos          ( 1 )                                              /*!< PDMA_T::TDSTS: TDIF1 Position        */
#define PDMA_TDSTS_TDIF1_Msk          ( 0x1ul << PDMA_TDSTS_TDIF1_Pos )                  /*!< PDMA_T::TDSTS: TDIF1 Mask            */

#define PDMA_TDSTS_TDIF2_Pos          ( 2 )                                              /*!< PDMA_T::TDSTS: TDIF2 Position        */
#define PDMA_TDSTS_TDIF2_Msk          ( 0x1ul << PDMA_TDSTS_TDIF2_Pos )                  /*!< PDMA_T::TDSTS: TDIF2 Mask            */

#define PDMA_TDSTS_TDIF3_Pos          ( 3 )                                              /*!< PDMA_T::TDSTS: TDIF3 Position        */
#define PDMA_TDSTS_TDIF3_Msk          ( 0x1ul << PDMA_TDSTS_TDIF3_Pos )                  /*!< PDMA_T::TDSTS: TDIF3 Mask            */

#define PDMA_TDSTS_TDIF4_Pos          ( 4 )                                              /*!< PDMA_T::TDSTS: TDIF4 Position        */
#define PDMA_TDSTS_TDIF4_Msk          ( 0x1ul << PDMA_TDSTS_TDIF4_Pos )                  /*!< PDMA_T::TDSTS: TDIF4 Mask            */

#define PDMA_TDSTS_TDIF5_Pos          ( 5 )                                              /*!< PDMA_T::TDSTS: TDIF5 Position        */
#define PDMA_TDSTS_TDIF5_Msk          ( 0x1ul << PDMA_TDSTS_TDIF5_Pos )                  /*!< PDMA_T::TDSTS: TDIF5 Mask            */

#define PDMA_TDSTS_TDIF6_Pos          ( 6 )                                              /*!< PDMA_T::TDSTS: TDIF6 Position        */
#define PDMA_TDSTS_TDIF6_Msk          ( 0x1ul << PDMA_TDSTS_TDIF6_Pos )                  /*!< PDMA_T::TDSTS: TDIF6 Mask            */

#define PDMA_TDSTS_TDIF7_Pos          ( 7 )                                              /*!< PDMA_T::TDSTS: TDIF7 Position        */
#define PDMA_TDSTS_TDIF7_Msk          ( 0x1ul << PDMA_TDSTS_TDIF7_Pos )                  /*!< PDMA_T::TDSTS: TDIF7 Mask            */

#define PDMA_TDSTS_TDIF8_Pos          ( 8 )                                              /*!< PDMA_T::TDSTS: TDIF8 Position        */
#define PDMA_TDSTS_TDIF8_Msk          ( 0x1ul << PDMA_TDSTS_TDIF8_Pos )                  /*!< PDMA_T::TDSTS: TDIF8 Mask            */

#define PDMA_TDSTS_TDIF9_Pos          ( 9 )                                              /*!< PDMA_T::TDSTS: TDIF9 Position        */
#define PDMA_TDSTS_TDIF9_Msk          ( 0x1ul << PDMA_TDSTS_TDIF9_Pos )                  /*!< PDMA_T::TDSTS: TDIF9 Mask            */

#define PDMA_TDSTS_TDIF10_Pos         ( 10 )                                             /*!< PDMA_T::TDSTS: TDIF10 Position        */
#define PDMA_TDSTS_TDIF10_Msk         ( 0x1ul << PDMA_TDSTS_TDIF10_Pos )                 /*!< PDMA_T::TDSTS: TDIF10 Mask            */

#define PDMA_TDSTS_TDIF11_Pos         ( 11 )                                             /*!< PDMA_T::TDSTS: TDIF11 Position        */
#define PDMA_TDSTS_TDIF11_Msk         ( 0x1ul << PDMA_TDSTS_TDIF11_Pos )                 /*!< PDMA_T::TDSTS: TDIF11 Mask            */

#define PDMA_TDSTS_TDIF12_Pos         ( 12 )                                             /*!< PDMA_T::TDSTS: TDIF12 Position        */
#define PDMA_TDSTS_TDIF12_Msk         ( 0x1ul << PDMA_TDSTS_TDIF12_Pos )                 /*!< PDMA_T::TDSTS: TDIF12 Mask            */

